OLD/results/results_1/disaggregated/out 128/test16-4img-rate1-total10-different-images_alexey-same-input/output.txt
[Wed Jul 22 08:48:31 AM UTC 2026] Waiting for http://e-disaggregation-epp:80/v1/models ...
  Endpoint up.

[Wed Jul 22 08:48:31 AM UTC 2026] === Rate 1 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='e-disaggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://e-disaggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='e-disaggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 83101
#Output tokens: 1280
#Total images: 40
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=1280
  Text prompt tokens (with chat template): avg=142.1, total=1421
  Text prompt overhead: avg=14.1, total=141
  Vision tokens: avg=8168.0, total=81680

Created 10 random jpeg images with average 8359061 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 10/10 [00:11<00:00,  1.11s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     10        
Benchmark duration (s):                  11.11     
Total input tokens:                      83101     
Total input text tokens:                 1421      
Total input vision tokens:               81680     
Total generated tokens:                  1280      
Total generated tokens (retokenized):    1270      
Request throughput (req/s):              0.90      
Input token throughput (tok/s):          7477.35   
Output token throughput (tok/s):         115.17    
Peak output token throughput (tok/s):    380.00    
Peak concurrent requests:                7         
Total token throughput (tok/s):          7592.53   
Concurrency:                             3.14      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3492.70   
Median E2E Latency (ms):                 3371.88   
P90 E2E Latency (ms):                    4546.36   
P95 E2E Latency (ms):                    4595.80   
P99 E2E Latency (ms):                    4635.35   
---------------Time to First Token----------------
Mean TTFT (ms):                          1292.85   
Median TTFT (ms):                        1201.03   
P90 TTFT (ms):                           1731.81   
P95 TTFT (ms):                           1784.64   
P99 TTFT (ms):                           1826.91   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.32     
Median TPOT (ms):                        16.66     
P90 TPOT (ms):                           25.19     
P95 TPOT (ms):                           25.95     
P99 TPOT (ms):                           26.57     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           17.93     
Median ITL (ms):                         12.58     
P90 ITL (ms):                            15.07     
P95 ITL (ms):                            25.29     
P99 ITL (ms):                            231.75    
Max ITL (ms):                            364.43    
==================================================
[Wed Jul 22 08:49:06 AM UTC 2026] Rate 1 done.
[Wed Jul 22 08:49:06 AM UTC 2026] All rates complete.